// Вивести на екран всі числа від 1 до 10 за допомогою циклу while.

i = 0; 
while(i < 10){
    i++; 
    console.log(i);
}

// Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for. 
// Якщо число не парне, пропустити його за допомогою continue.



for(let n = 2; n < 21; n++){ 
    if(n % 2 === 0){ 
        console.log(n);
    }else{ 
        continue; 
    }
}


// Вивести на екран таблицю множення числа 7 за допомогою циклу for.

for(let s = 0; s < 11; s++){ 
    r = s * 7; 
    console.log(r);
} 


// Створити масив з числами від 1 до 5. Вивести на екран кожен елемент масиву за допомогою циклу while.

let arr = [1, 2, 3, 4, 5]; 

c = 0; 
arrlen = arr.length;

while (c < arrlen) {
    console.log(arr[c]); 
    c++;
}

// Створити масив із числами від 1 до 10.
//  За допомогою циклу for пройтися по масиву та вивести на екран всі числа,
//   крім числа 7. Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.

let arr1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]; 

for(let p = 0; p < arr1.length; p++){ 
    if(arr1[p] != 7){ 
        console.log(arr1[p]); 
    }else{ 
        break; 
    }
}

// Створити скрипт, який виводить на екран всі числа, які менші за n.
//  Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.


number = prompt("Enter your number >>>"); 

for(let k = 0; k < number; k++){ 
    if(k < number){ 
        console.log(k);
    }else{ 
        break;  // Але цього ніколи не буде ;))))) 
    }
}


// За допомогою циклу while вивести на екран всі числа від 1 до 20,
//  крім чисел, кратних 3. Якщо зустрінете число, кратне 3,
//  цикл повинен продовжити виконання за допомогою оператора continue. 


let counter = 0; 
while(counter <= 20){ 
    counter++
    if(counter % 3 != 0){ 
        console.log(counter); 
    }else{ 
        continue; 
    }
}